<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"509ba958327467f6eb726332d5b829913bea8b2ba300c87e87c6cf27bbe4d32e","plan_job_ref":"Job Staging Image Build & Push #60 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7444620906","plan_hash":"3e5ddfa9ac2ee5e9f1154509762070c4830357a40eb790e163208560b7b90bac","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 2 to add, 4 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_group.ASG_config will be updated in-place
!~  resource "aws_autoscaling_group" "ASG_config" {
+       desired_capacity_type            = "units"
        id                               = "fastapi-ASG-dev"
        name                             = "fastapi-ASG-dev"
#        (26 unchanged attributes hidden)

#        (5 unchanged blocks hidden)
    }

  # aws_ecs_cluster.fastapi-cluster will be updated in-place
!~  resource "aws_ecs_cluster" "fastapi-cluster" {
        id       = "arn:aws:ecs:eu-central-1:806066816337:cluster/fastapi-cluster"
        name     = "fastapi-cluster"
!~      tags     = {
-           "Environment" = "Prod Environment" -> null
        }
!~      tags_all = {
!~          "Environment" = "Prod Environment" -> "Dev Environment"
        }
#        (1 unchanged attribute hidden)

#        (2 unchanged blocks hidden)
    }

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:47" -> (known after apply)
#        (15 unchanged attributes hidden)

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:47" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:61e1d652c5704639e2e735457c4cd884ada8cc77" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:0eddadda493e2dd22fde5c3b8874e93e597f8080"
!~                  memory       = 512 -> 256
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (2 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "*********************" -> (known after apply)
+       network_mode             = (known after apply)
!~      revision                 = 47 -> (known after apply)
-       tags                     = {} -> null
#        (4 unchanged attributes hidden)
    }

  # aws_iam_instance_profile.instance_profile must be replaced
-/+ resource "aws_iam_instance_profile" "instance_profile" {
!~      arn         = "arn:aws:iam::806066816337:instance-profile/InstanceRoleForECS" -> (known after apply)
!~      create_date = "2024-01-07T18:37:56Z" -> (known after apply)
!~      id          = "******************" -> (known after apply)
!~      name        = "InstanceRoleForECS" -> "InstanceRoleForECS_dev" # forces replacement
+       name_prefix = (known after apply)
-       tags        = {} -> null
!~      unique_id   = "*********************" -> (known after apply)
#        (3 unchanged attributes hidden)
    }

  # aws_launch_template.ASG_template will be updated in-place
!~  resource "aws_launch_template" "ASG_template" {
        id                      = "lt-0fb24dbdf35f7cf64"
!~      latest_version          = 4 -> (known after apply)
        name                    = "LaunchTemplateECR20240107162659112500000001"
        tags                    = {}
#        (11 unchanged attributes hidden)

!~      iam_instance_profile {
!~          name = "InstanceRoleForECS" -> "InstanceRoleForECS_dev"
        }

#        (1 unchanged block hidden)
    }

Plan: 2 to add, 4 to change, 2 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Image Build & Push #60](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7444620906)
<details open><summary>Outputs</summary>

```hcl
ecr_registry_id     = "806066816337"
ecr_repository_name = "dev/irezd/fastapi"
```
</details>